--[[
    
    и возможно в go to надо будет перетащить wait

    
    возможно функцию. addDishToBar из заказа перетащить в повара
    
    можно добавить проверку на длины список для того чтобы выставить приоритет, например если give order больше то разносим заказы,
    если take order то собираем
    
    забрать ингредиенты блюда с QA
    забрать npc

    можно изменить размеры хитбоксов для столов и тогда можно будет запихать больше столов на этаж

    надо переделать всю фурнитуру, так как не подходит под размер нпс
    добавить в стулья primary

    походу будет только две кухни, так что можно отказаться от индексов в конце назавний кухонь
    и возможно еще убрать кухни из папок с этажами

    добавить проверку если гости ужезаспавнены то не стоит их еще спавнить, чтобы толкучки избежать

    поправить индескацию работников в таблице
    
    
]]

--[[
        СДЕЛАНО

    надо поменять в playerDataType конфиг со стульями и столом, как и кухонная утварь,
    добавить уровень и сделать так чтобы это был массив без названий, так можно будет избежать 
    дополнительных циклов в контроллере
        и тогда сразу переписать контент лоадер

    подумать как соеденить стул и точку на столе

    в game controller убрать логику для хождения в классы чтобы облегчить

    изменять состояние только внутри классов из game controller только запускать методы
]]